# ------------------------------------------------------------
# 1. Основные параметры компилятора
# ------------------------------------------------------------

# 1.1 Тип
CXX = g++

# 1.2 Флаги
CXXFLAGS = -Wall, -Wextra -02 -I./src

# 1.3 Имя исполняемого файла
TARGET = Console_chat_by_Dima_Prihodko


# ------------------------------------------------------------
# 2. Пути
# Дерево проекта:
# ├── app/
# │   ├── src/
# │   │   ├── Chat/
# │   │   ├── Message/
# │   │   ├── User/
# │   │   └── utils/
# │   ├── main.cpp
# ├── Makefile
# ------------------------------------------------------------

SOURCES = \
main.cpp \
src/Chat/Chat.cpp \

src/Message/Message.cpp \
src/User/User.cpp \
src/Chat/Chat.cpp \















